In [1]:
import pandas as pd
import re

In [2]:
df_raw = pd.read_csv(
    '../data/interim/job_offers_2023-03-06.csv',
    sep=';',
    encoding='UTF-8'
)
df_raw.head()

,name,company,technology,location_city,salary_low,salary_high,salary_currency
0,Data Engineer,Ramp Network,BigQuery,Warszawa,12000,19000,PLN
1,Senior Data Engineer,Acaisoft Poland Sp. z.o.o,Python,"('Zdalna',)",26000,31000,PLN
2,Big Data Engineering Tech Lead,P2 Recruitment,Python,"('Zdalna',)",18000,30000,PLN
3,Remote - Senior Azure Data Engineer,Infosys Consulting,Azure,"('Zdalna',)",20000,32000,PLN
4,Databricks Data Engineer with Python,AXA IT Solutions,Python,Warszawa,26880,34440,PLN

In [3]:
df = df_raw.copy()

In [4]:
df[df['salary_currency']!='PLN']

Empty DataFrame
Columns: [name, company, technology, location_city, salary_low, salary_high, salary_currency]
Index: []

In [5]:
df = df.loc[df['salary_currency'] == 'PLN']
df['name'] = df['name'].str.lower()
df['location_city'] = df['location_city'].str.lower()

In [6]:
# srednia z kolumn salary
df['salary_avg'] = (df['salary_low'] + df['salary_high'])/2

In [9]:
df['location_city'].unique()

array(['warszawa', "('zdalna',)", 'poznań', 'kraków'], dtype=object)

In [15]:
df.loc[df['location_city'].isin(['warsaw', 'warszawa']), 'location_city'] = 'warszawa'
df.loc[df['location_city'].isin(['gdańsk', 'gdansk']), 'location_city'] = 'gdańsk'

In [16]:
df['is_senior'] = df['name'].str.contains('senior', case=False, regex=True).astype(int)

In [17]:
df

,name,company,technology,location_city,salary_low,salary_high,salary_currency,salary_avg,is_senior
0,data engineer,Ramp Network,BigQuery,warszawa,12000,19000,PLN,15500.0,0
1,senior data engineer,Acaisoft Poland Sp. z.o.o,Python,"('zdalna',)",26000,31000,PLN,28500.0,1
2,big data engineering tech lead,P2 Recruitment,Python,"('zdalna',)",18000,30000,PLN,24000.0,0
3,remote - senior azure data engineer,Infosys Consulting,Azure,"('zdalna',)",20000,32000,PLN,26000.0,1
4,databricks data engineer with python,AXA IT Solutions,Python,warszawa,26880,34440,PLN,30660.0,0
5,senior big data engineer - data & ai,Allegro,Scala,poznań,16100,23200,PLN,19650.0,1
6,senior data engineer (golang),Bayer Sp. z o.o.,Golang,warszawa,20000,26000,PLN,23000.0,1
7,senior data engineer (kafka),Sigma IT Poland,Python,"('zdalna',)",23500,28500,PLN,26000.0,1
8,data engineer,Roche,Python,poznań,16000,21000,PLN,18500.0,0
9,data engineer with python,Sigma IT Poland,Python,"('zdalna',)",22000,26880,PLN,24440.0,0
10,data engineer with scala,GFT Poland,Scala,"('zdalna',)",18480,26880,PLN,22680.0,0
11,junior/mid data engineer (biotech),Sigma IT Poland,Python,"('zdalna',)",18000,25000,PLN,21500.0,0
12,data scientist / data engineer,vonRoll Infratec.com,Python,kraków,20000,26000,PLN,23000.0,0
13,data engineer (allegro pay),Allegro,NaN,warszawa,12300,17600,PLN,14950.0,0
14,senior performance engineer,Cribl,JavaScript,"('zdalna',)",16666,29166,PLN,22916.0,1
15,remote mid/senior data engineer,CSHARK Sp. z o.o.,Python,"('zdalna',)",24000,30000,PLN,27000.0,1
16,software engineer -data platforms,Adform Sp. z o.o.,Scala,warszawa,17136,25200,PLN,21168.0,0
17,remote mid data engineer,Operator Chmury Krajowej,SQL,"('zdalna',)",10000,14000,PLN,12000.0,0
18,software engineer (big data),Adform Sp. z o.o.,Scala,warszawa,17136,25200,PLN,21168.0,0
19,big data engineer,Grid Dynamics,Scala,"('zdalna',)",21000,37000,PLN,29000.0,0

In [18]:
df.to_csv('../data/processed/job_offers.csv',
    sep=';',
    encoding='UTF-8',
    index=False)